In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [15]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [16]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [17]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [18]:
inputs.drop(['male','Sex'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [20]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [21]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [22]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.3)

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [24]:
model.fit(X_train,y_train)

GaussianNB()

In [25]:
model.score(X_test,y_test)

0.7798507462686567

In [26]:
X_test[:10]

     Pclass        Age      Fare  female
357       2  38.000000   13.0000       1
433       3  17.000000    7.1250       0
819       3  10.000000   27.9000       0
174       1  56.000000   30.6958       0
103       3  33.000000    8.6542       0
461       3  34.000000    8.0500       0
36        3  29.699118    7.2292       0
434       1  50.000000   55.9000       0
813       3   6.000000   31.2750       1
802       1  11.000000  120.0000       0

In [27]:
y_test[:10]

357    0
433    0
819    0
174    0
103    0
461    0
36     1
434    0
813    0
802    1
Name: Survived, dtype: int64

In [28]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 0, 0, 0, 0, 1, 1], dtype=int64)

In [29]:
model.predict_proba(X_test[:10])

array([[0.23919108, 0.76080892],
       [0.95250223, 0.04749777],
       [0.9392533 , 0.0607467 ],
       [0.78003202, 0.21996798],
       [0.96499814, 0.03500186],
       [0.96532285, 0.03467715],
       [0.96317669, 0.03682331],
       [0.67812264, 0.32187736],
       [0.22818878, 0.77181122],
       [0.03404328, 0.96595672]])

In [30]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.776     , 0.768     , 0.776     , 0.75      , 0.82258065])